src/main/resources/arca_intra_search_codice_arca.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:arca="http://arca.services.soa.sistinf.it">
    <soapenv:Header>
        <inps:Identity xmlns:inps="http://inps.it/">
            <AppName>%s</AppName>
            <AppKey>%s</AppKey>
            <UserId>%s</UserId>
            <IdentityProvider>%s</IdentityProvider>
        </inps:Identity>
    </soapenv:Header>
    <soapenv:Body>
        <arca:DiacRicercaConCodiceArcaRequest>
            <arca:Sicurezza>
                <arca:CodiceTipoOperatore>#CODICE_TIPO_OPERATORE</arca:CodiceTipoOperatore>
                <arca:Provenienza>#PROVENIENZA</arca:Provenienza>
                <arca:CodiceFiscaleOperatore>#CF</arca:CodiceFiscaleOperatore>
                <arca:MatricolaINPS>#MINPS</arca:MatricolaINPS>
                <arca:SedeRichiesta>#SRIC</arca:SedeRichiesta>
                <arca:GestioneApplOrigine>#GAPPL</arca:GestioneApplOrigine>
                <arca:SedeApplOrigine>#SAPPL</arca:SedeApplOrigine>
                <arca:PgmApplOrigine>#PGMAPPL</arca:PgmApplOrigine>
                <arca:TranApplOrigine>#WSINTRA</arca:TranApplOrigine>
                <arca:Funzione>#FUNZ</arca:Funzione>
                <arca:WsReserved>#WSRESERVED</arca:WsReserved>
            </arca:Sicurezza>
            <arca:Ricerca>
                <arca:Profilo>#PROFILO</arca:Profilo>
                <arca:TipoChiavePresente>#TIPO_CHIAVE</arca:TipoChiavePresente>
                <arca:ChiaveARCA>%s</arca:ChiaveARCA>
            </arca:Ricerca>
        </arca:DiacRicercaConCodiceArcaRequest>
    </soapenv:Body>
</soapenv:Envelope>
